Revit 2024 API
PickedBox.Max Property
Maximum coordinates (upper-right-front corner of the pick box).
Namespace: Autodesk.Revit.UI.Selection
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public XYZ Max { get; set; }
Visual Basic
Public Property Max As XYZ
	Get
	Set
Visual C++
public:
property XYZ^ Max {
	XYZ^ get ();
	void set (XYZ^ value);
}
See Also
PickedBox Class
Autodesk.Revit.UI.Selection Namespace